docs/loadtest-results/t1-2026-06-22-k6-summary.txt
    checks_total.......: 1424   2.86105/s
    checks_succeeded...: 98.45% 1402 out of 1424
    checks_failed......: 1.54%  22 out of 1424

    ✗ request 201
      ↳  97% — ✓ 702 / ✗ 20
    ✗ connected 200
      ↳  99% — ✓ 700 / ✗ 2

    CUSTOM
    listener_heartbeat_5xx.........: 1737   3.489918/s
    listener_heartbeat_failed......: 16.38% 1737 out of 10598
    listener_heartbeat_ms..........: avg=1.24s min=80.28ms  med=336.87ms p(90)=2.8s  p(95)=3.57s p(99)=29.08s max=39.95s
    listener_join_failed...........: 3.03%  22 out of 724
    listener_join_ms...............: avg=2.34s min=0s       med=1.08s    p(90)=5.84s p(95)=5.95s p(99)=6.51s  max=7.12s 
    listener_status_poll_failed....: 15.23% 3097 out of 20332
    listener_status_poll_ms........: avg=1.97s min=79.29ms  med=623.72ms p(90)=4.5s  p(95)=5.37s p(99)=31.63s max=34.92s

    HTTP
    http_req_duration..............: avg=1.77s min=0s       med=518.22ms p(90)=4.32s p(95)=5.19s p(99)=30.68s max=39.95s
      { expected_response:true }...: avg=1.99s min=169.98ms med=624.01ms p(90)=4.47s p(95)=5.6s  p(99)=31.27s max=39.95s
    http_req_failed................: 14.96% 4856 out of 32454
    http_reqs......................: 32454  65.205409/s

    EXECUTION
    iteration_duration.............: avg=4m9s  min=1.08s    med=5m2s     p(90)=5m3s  p(95)=5m3s  p(99)=5m4s   max=5m4s  
    iterations.....................: 122    0.245118/s
    vus............................: 600    min=1             max=600 
    vus_max........................: 1500   min=1500          max=1500

    NETWORK
    data_received..................: 19 MB  38 kB/s
    data_sent......................: 3.6 MB 7.3 kB/s